josuemoraisgh/qemu_lasecSimul/hw/xtensa/esp32-simul.c
/*
 * ESP32 SoC and machine
 *
 * Copyright (c) 2019 Espressif Systems (Shanghai) Co. Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/error-report.h"
#include "qemu/units.h"
#include "qapi/error.h"
#include "hw/hw.h"
#include "hw/boards.h"
#include "hw/loader.h"
#include "hw/sysbus.h"
#include "hw/i2c/esp32_i2c.h"
#include "hw/xtensa/xtensa_memory.h"
#include "hw/misc/unimp.h"
#include "hw/irq.h"
//#include "hw/i2c/i2c.h"
#include "hw/qdev-properties.h"
#include "hw/xtensa/esp32.h"
#include "hw/misc/ssi_psram.h"
#include "hw/sd/dwc_sdmmc.h"
#include "core-esp32/core-isa.h"
#include "qemu/datadir.h"
#include "sysemu/sysemu.h"
#include "sysemu/reset.h"
#include "sysemu/cpus.h"
#include "sysemu/runstate.h"
#include "sysemu/blockdev.h"
#include "sysemu/block-backend.h"
#include "exec/exec-all.h"
#include "net/net.h"
#include "elf.h"

#include "../softmmu/simuliface.h"
#include "esp32-simul.h"

#define TYPE_ESP32_SOC "xtensa.esp32-simul"
#define ESP32_SOC(obj) OBJECT_CHECK(Esp32SocState, (obj), TYPE_ESP32_SOC)

#define TYPE_ESP32_CPU XTENSA_CPU_TYPE_NAME("esp32")


Esp32SocState* esp32SOC;
//----------------------------------------------


enum {
    ESP32_MEMREGION_IROM,
    ESP32_MEMREGION_DROM,
    ESP32_MEMREGION_DRAM,
    ESP32_MEMREGION_IRAM,
    ESP32_MEMREGION_ICACHE0,
    ESP32_MEMREGION_ICACHE1,
    ESP32_MEMREGION_RTCSLOW,
    ESP32_MEMREGION_RTCFAST_D,
    ESP32_MEMREGION_RTCFAST_I,
    ESP32_MEMREGION_FRAMEBUF,
};

static const struct MemmapEntry {
    hwaddr base;
    hwaddr size;
} esp32_memmap[] = {
    [ESP32_MEMREGION_DROM]      = { 0x3ff90000, 0x10000 },
    [ESP32_MEMREGION_IROM]      = { 0x40000000, 0x70000 },
    [ESP32_MEMREGION_DRAM]      = { 0x3ffae000, 0x52000 },
    [ESP32_MEMREGION_IRAM]      = { 0x40080000, 0x40000 },
    [ESP32_MEMREGION_ICACHE0]   = { 0x40070000, 0x8000 },
    [ESP32_MEMREGION_ICACHE1]   = { 0x40078000, 0x8000 },
    [ESP32_MEMREGION_RTCSLOW]   = { 0x50000000, 0x2000 },
    [ESP32_MEMREGION_RTCFAST_I] = { 0x400C0000, 0x2000 },
    [ESP32_MEMREGION_RTCFAST_D] = { 0x3ff80000, 0x2000 },
    [ESP32_MEMREGION_FRAMEBUF]  = { 0x20000000, ESP_RGB_MAX_VRAM_SIZE } /* Virtual Framebuffer, used for the graphical interface */
};


#define ESP32_SOC_RESET_PROCPU    0x1
#define ESP32_SOC_RESET_APPCPU    0x2
#define ESP32_SOC_RESET_PERIPH    0x4
#define ESP32_SOC_RESET_DIG       (ESP32_SOC_RESET_PROCPU | ESP32_SOC_RESET_APPCPU | ESP32_SOC_RESET_PERIPH)
#define ESP32_SOC_RESET_RTC       0x8
#define ESP32_SOC_RESET_ALL       (ESP32_SOC_RESET_RTC | ESP32_SOC_RESET_DIG)


void setInterrupt(void)
{
    uint8_t irqNumber = m_arena->irqNumber;
    uint8_t irqLevel  = m_arena->irqLevel;

    m_arena->irqNumber = 0;
    //m_arena->irqLevel  = 0;

    DeviceState* intmatrix_dev = DEVICE( &esp32SOC->intmatrix );
    qemu_irq irq = qdev_get_gpio_in( intmatrix_dev, irqNumber);

    printf("Qemu: setInterrupt %i %i", irqNumber, irqLevel ); fflush( stdout );
    if( irq ) qemu_set_irq( irq, irqLevel );
    //else      printf(" Not found\n" );
}

static void remove_cpu_watchpoints(XtensaCPU* xcs)
{
    for( int i=0; i<MAX_NDBREAK; ++i){
        if( xcs->env.cpu_watchpoint[i]){
            cpu_watchpoint_remove_by_ref(CPU(xcs), xcs->env.cpu_watchpoint[i]);
            xcs->env.cpu_watchpoint[i] = NULL;
        }
    }
}

static void esp32_dig_reset(void *opaque, int n, int level)
{
    if( !level ) return;
    Esp32SocState *s = ESP32_SOC(opaque);

    esp32_dport_clear_ill_trap_state(&s->dport);
    s->requested_reset = ESP32_SOC_RESET_DIG;
    qemu_system_reset_request(SHUTDOWN_CAUSE_GUEST_RESET);
}

static void esp32_cpu_reset(void* opaque, int n, int level)
{
    if( !level ) return;
    Esp32SocState *s = ESP32_SOC(opaque);

    s->requested_reset = (n == 0) ? ESP32_SOC_RESET_PROCPU : ESP32_SOC_RESET_APPCPU;
    /* Use different cause for APP CPU so that its reset doesn't cause QEMU to exit,
     * when -no-reboot option is given.
     */
    ShutdownCause cause = (n == 0) ? SHUTDOWN_CAUSE_GUEST_RESET : SHUTDOWN_CAUSE_SUBSYSTEM_RESET;
    s->rtc_cntl.reset_cause[n] = ESP32_SW_CPU_RESET;
    qemu_system_reset_request(cause);
}

static void esp32_timg_cpu_reset(void* opaque, int n, int level)
{
    if( !level ) return;
    Esp32SocState *s = ESP32_SOC(opaque);

    s->requested_reset = (n == 0) ? ESP32_SOC_RESET_PROCPU : ESP32_SOC_RESET_APPCPU;
    /* Use different cause for APP CPU so that its reset doesn't cause QEMU to exit,
     * when -no-reboot option is given.
     */
    ShutdownCause cause = (n == 0) ? SHUTDOWN_CAUSE_GUEST_RESET : SHUTDOWN_CAUSE_SUBSYSTEM_RESET;
    s->rtc_cntl.reset_cause[n] = ESP32_TGWDT_CPU_RESET;
    qemu_system_reset_request(cause);
}

static void esp32_timg_sys_reset(void* opaque, int n, int level)
{
    if( !level ) return;
    Esp32SocState *s = ESP32_SOC(opaque);

    esp32_dport_clear_ill_trap_state(&s->dport);
    s->requested_reset = ESP32_SOC_RESET_DIG;
    for( int i=0; i<ESP32_CPU_COUNT; ++i) {
        s->rtc_cntl.reset_cause[i] = ESP32_TG0WDT_SYS_RESET + n;
    }
    qemu_system_reset_request(SHUTDOWN_CAUSE_GUEST_RESET);
}

static void esp32_soc_reset(DeviceState *dev)
{
    Esp32SocState *s = ESP32_SOC(dev);

    //printf("\nesp32_soc_reset %i \n\n", s->requested_reset );

    uint32_t strap_mode = s->gpio.strap_mode;

    bool flash_boot_mode = ((strap_mode & 0x10) || (strap_mode & 0x1f) == 0x0c);
    qemu_set_irq( qdev_get_gpio_in_named( DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_DL_MODE_GPIO, 0), !flash_boot_mode);

    if( s->requested_reset == 0 ) s->requested_reset = ESP32_SOC_RESET_ALL;

    if( s->requested_reset & ESP32_SOC_RESET_RTC ) device_cold_reset( DEVICE(&s->rtc_cntl) );

    if( s->requested_reset & ESP32_SOC_RESET_PERIPH )
    {
        device_cold_reset( DEVICE(&s->dport) );
        device_cold_reset( DEVICE(&s->intmatrix) );
        device_cold_reset( DEVICE(&s->aes) );
        device_cold_reset( DEVICE(&s->sha) );
        device_cold_reset( DEVICE(&s->rsa) );
        device_cold_reset( DEVICE(&s->gpio) );

