josuemoraisgh/qemu_lasecSimul/hw/xtensa/esp32-simul.c
        for (int i = 0; i < ESP32_UART_COUNT; ++i ) device_cold_reset( DEVICE(&s->uart[i]) );
        for (int i = 0; i < ESP32_FRC_COUNT;  ++i ) device_cold_reset( DEVICE(&s->frc_timer[i]) );
        for (int i = 0; i < ESP32_TIMG_COUNT; ++i ) device_cold_reset( DEVICE(&s->timg[i]) );

        s->timg[0].flash_boot_mode = flash_boot_mode;

        for (int i = 0; i < ESP32_SPI_COUNT; ++i ) device_cold_reset( DEVICE(&s->spi[i]));
        for (int i = 0; i < ESP32_I2C_COUNT; i++ ) device_cold_reset( DEVICE(&s->i2c[i]));

        device_cold_reset(DEVICE(&s->efuse));

        if ( s->eth     ) device_cold_reset( s->eth);
        if ( s->wifi_dev) device_cold_reset( s->wifi_dev);

        device_cold_reset( DEVICE(&s->rmt) );
        device_cold_reset( DEVICE(&s->rgb) );
    }
    if (s->requested_reset & ESP32_SOC_RESET_PROCPU)
    {
        xtensa_select_static_vectors(&s->cpu[0].env, s->rtc_cntl.stat_vector_sel[0]);
        remove_cpu_watchpoints(&s->cpu[0]);
        cpu_reset(CPU(&s->cpu[0]));
    }
    if (s->requested_reset & ESP32_SOC_RESET_APPCPU)
    {
        xtensa_select_static_vectors(&s->cpu[1].env, s->rtc_cntl.stat_vector_sel[1]);
        remove_cpu_watchpoints(&s->cpu[1]);
        cpu_reset(CPU(&s->cpu[1]));
    }
    s->requested_reset = 0;
}

static void esp32_cpu_stall(void* opaque, int n, int level)
{
    Esp32SocState *s = ESP32_SOC(opaque);

    bool stall;
    if( n == 0) {
        stall = s->rtc_cntl.cpu_stall_state[0];
    } else {
        stall =   s->rtc_cntl.cpu_stall_state[1]
              ||  s->dport.appcpu_stall_state
              || !s->dport.appcpu_clkgate_state;
    }

    if( stall != s->cpu[n].env.runstall)
        xtensa_runstall(&s->cpu[n].env, stall);
}

uint32_t esp32_soc_get_apb_freq(void) { return esp32SOC->apb_clk_freq; }
uint32_t esp32_soc_get_cpu_freq(void) { return esp32SOC->cpu_clk_freq; }

static void esp32_clk_update( void* opaque, int n, int level )
{
    //printf("Qemu: esp32_clk_update\n"); fflush( stdout );
    if( !level) return;

    Esp32SocState *s = ESP32_SOC(opaque);

    /* APB clock */
    //uint32_t apb_clk_freq, cpu_clk_freq;
    if( s->rtc_cntl.soc_clk == ESP32_SOC_CLK_PLL)
    {
        const uint32_t cpu_clk_mul[] = {1, 2, 3};
        s->apb_clk_freq = s->rtc_cntl.pll_apb_freq;
        s->cpu_clk_freq = cpu_clk_mul[s->dport.cpuperiod_sel] * s->apb_clk_freq;
    } else {
        s->apb_clk_freq = s->rtc_cntl.xtal_apb_freq;
        s->cpu_clk_freq = s->apb_clk_freq;
    }
    qdev_prop_set_int32( DEVICE(&s->frc_timer), "apb_freq", s->apb_clk_freq );
    qdev_prop_set_int32( DEVICE(&s->timg[0])  , "apb_freq", s->apb_clk_freq );
    qdev_prop_set_int32( DEVICE(&s->timg[1])  , "apb_freq", s->apb_clk_freq );

    clock_update_hz( s->cpu[0].clock, s->cpu_clk_freq );
    clock_update_hz( s->cpu[1].clock, s->cpu_clk_freq );

    updtCpuFreqHz( s->cpu_clk_freq );

    waitForSynch();
    m_arena->regData = s->cpu_clk_freq;
    m_arena->regAddr = s->apb_clk_freq;
    m_arena->simuAction = SIM_FREQ;
    m_arena->simuTime = getQemu_ps();

    //double ps_instr = (double)cpu_clk_freq/1000000;
    //ps_instr = 1000000/ps_instr;
    //if( m_arena->ps_per_inst != ps_instr )
    //{
    //    uint64_t qemuTime = getQemu_ps()/1000; // Update last cpu time and icount before ps_per_inst
    //    m_arena->ps_per_inst = ps_instr;
    //    printf("Qemu: esp32_clk_update CPU Freq Hz: %i %i %f at %lu\n", apb_clk_freq, cpu_clk_freq, ps_instr, qemuTime ); fflush( stdout );
    //}
}

static void esp32_soc_add_periph_device(MemoryRegion *dest, void* dev, hwaddr dport_base_addr)
{
    MemoryRegion *mr = sysbus_mmio_get_region(SYS_BUS_DEVICE(dev), 0);
    memory_region_add_subregion_overlap(dest, dport_base_addr, mr, 0);

    MemoryRegion *mr_apb = g_new(MemoryRegion, 1);
    char *name = g_strdup_printf("mr-apb-0x%08x", (uint32_t) dport_base_addr);

    memory_region_init_alias(mr_apb, OBJECT(dev), name, mr, 0, memory_region_size(mr));
    memory_region_add_subregion_overlap(dest, dport_base_addr - DR_REG_DPORT_APB_BASE + APB_REG_BASE, mr_apb, 0);

    g_free( name );
}

static void esp32_soc_add_unimp_device(MemoryRegion *dest, const char* name, hwaddr dport_base_addr, size_t size, uint32_t default_value)
{
    create_unimplemented_device_default_value(name, dport_base_addr, size, default_value);
    char * name_apb = g_strdup_printf("%s-apb", name);
    create_unimplemented_device_default_value(name_apb, dport_base_addr - DR_REG_DPORT_APB_BASE + APB_REG_BASE, size, default_value);
    g_free(name_apb);
}

static void esp32_soc_realize( DeviceState *dev, Error **errp )
{
    Esp32SocState *s = ESP32_SOC(dev);
    MachineState *ms = MACHINE(qdev_get_machine());

    esp32SOC = s;

    const struct MemmapEntry *memmap = esp32_memmap;
    MemoryRegion *sys_mem = get_system_memory();

    MemoryRegion *dram      = g_new( MemoryRegion, 1 );
    MemoryRegion *iram      = g_new( MemoryRegion, 1 );
    MemoryRegion *icache0   = g_new( MemoryRegion, 1 );
    MemoryRegion *icache1   = g_new( MemoryRegion, 1 );
    MemoryRegion *rtcslow   = g_new( MemoryRegion, 1 );
    MemoryRegion *rtcfast_i = g_new( MemoryRegion, 1 );
    MemoryRegion *rtcfast_d = g_new( MemoryRegion, 1 );

    for (int i = 0; i < ms->smp.cpus; ++i)
    {
        assert(i >= 0 && i <= 9);
        MemoryRegion *drom = g_new(MemoryRegion, 1);
        MemoryRegion *irom = g_new(MemoryRegion, 1);

        char name[16];
        snprintf(name, sizeof(name), "esp32.irom.cpu%d", i);
        memory_region_init_rom(irom, NULL, name,
                               memmap[ESP32_MEMREGION_IROM].size, &error_fatal);
        memory_region_add_subregion(&s->cpu_specific_mem[i], memmap[ESP32_MEMREGION_IROM].base, irom);


        snprintf(name, sizeof(name), "esp32.drom.cpu%d", i);
        memory_region_init_alias(drom, NULL, name, irom, 0x60000, memmap[ESP32_MEMREGION_DROM].size);
        memory_region_add_subregion(&s->cpu_specific_mem[i], memmap[ESP32_MEMREGION_DROM].base, drom);
    }

    memory_region_init_ram(dram, NULL, "esp32.dram", memmap[ESP32_MEMREGION_DRAM].size, &error_fatal);
    memory_region_add_subregion(sys_mem, memmap[ESP32_MEMREGION_DRAM].base, dram);

    memory_region_init_ram(iram, NULL, "esp32.iram", memmap[ESP32_MEMREGION_IRAM].size, &error_fatal);
    memory_region_add_subregion(sys_mem, memmap[ESP32_MEMREGION_IRAM].base, iram);

    memory_region_init_ram(icache0, NULL, "esp32.icache0", memmap[ESP32_MEMREGION_ICACHE0].size, &error_fatal);
    memory_region_add_subregion(sys_mem, memmap[ESP32_MEMREGION_ICACHE0].base, icache0);

    memory_region_init_ram(icache1, NULL, "esp32.icache1", memmap[ESP32_MEMREGION_ICACHE1].size, &error_fatal);
    memory_region_add_subregion(sys_mem, memmap[ESP32_MEMREGION_ICACHE1].base, icache1);

