josuemoraisgh/qemu_lasecSimul/hw/xtensa/esp32-simul.c
    memory_region_init_ram(rtcslow, NULL, "esp32.rtcslow", memmap[ESP32_MEMREGION_RTCSLOW].size, &error_fatal);
    memory_region_add_subregion(sys_mem, memmap[ESP32_MEMREGION_RTCSLOW].base, rtcslow);

    /* RTC Fast memory is only accessible by the PRO CPU */

    memory_region_init_ram(rtcfast_i, NULL, "esp32.rtcfast_i", memmap[ESP32_MEMREGION_RTCSLOW].size, &error_fatal);
    memory_region_add_subregion(&s->cpu_specific_mem[0], memmap[ESP32_MEMREGION_RTCFAST_I].base, rtcfast_i);

    memory_region_init_alias(rtcfast_d, NULL, "esp32.rtcfast_d", rtcfast_i, 0, memmap[ESP32_MEMREGION_RTCFAST_D].size);
    memory_region_add_subregion(&s->cpu_specific_mem[0], memmap[ESP32_MEMREGION_RTCFAST_D].base, rtcfast_d);

    for (int i = 0; i < ms->smp.cpus; ++i)
        qdev_realize( DEVICE(&s->cpu[i]), NULL, &error_fatal);

    qdev_realize( DEVICE(&s->dport), &s->periph_bus, &error_fatal);
    MemoryRegion* dport_mem = sysbus_mmio_get_region(SYS_BUS_DEVICE(&s->dport), 0);

    memory_region_add_subregion( sys_mem, DR_REG_DPORT_BASE, dport_mem);
    qdev_connect_gpio_out_named( DEVICE(&s->dport)   , ESP32_DPORT_APPCPU_RESET_GPIO, 0, qdev_get_gpio_in_named( dev, ESP32_RTC_CPU_RESET_GPIO, 1));
    qdev_connect_gpio_out_named( DEVICE(&s->dport)   , ESP32_DPORT_APPCPU_STALL_GPIO, 0, qdev_get_gpio_in_named( dev, ESP32_RTC_CPU_STALL_GPIO, 1));
    qdev_connect_gpio_out_named( DEVICE(&s->rtc_cntl), ESP32_DPORT_CLK_UPDATE_GPIO  , 0, qdev_get_gpio_in_named( dev, ESP32_RTC_CLK_UPDATE_GPIO, 0));

    for (int i = 0; i < ESP32_CPU_COUNT; ++i)
    {
        char name[16];
        snprintf(name, sizeof(name), "cpu%d", i);
        object_property_set_link(OBJECT(&s->intmatrix), name, OBJECT(qemu_get_cpu(i)), &error_abort);
    }
    qdev_realize( DEVICE(&s->intmatrix), &s->periph_bus, &error_fatal);
    DeviceState* intmatrix_dev = DEVICE(&s->intmatrix);
    memory_region_add_subregion_overlap(dport_mem, ESP32_DPORT_PRO_INTMATRIX_BASE, sysbus_mmio_get_region(SYS_BUS_DEVICE(&s->intmatrix), 0), -1);

    bool init_cache_err = false;
    if (s->dport.flash_blk)
    {
        for (int i = 0; i < ESP32_CPU_COUNT; ++i)
        {
            Esp32CacheRegionState *drom0 = &s->dport.cache_state[i].drom0;
            memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], drom0->base, &drom0->illegal_access_trap_mem, -2);
            memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], drom0->base, &drom0->mem, -1);

            Esp32CacheRegionState *iram0 = &s->dport.cache_state[i].iram0;
            memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], iram0->base, &iram0->illegal_access_trap_mem, -2);
            memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], iram0->base, &iram0->mem, -1);
        }
        init_cache_err = true;
    }
    if (s->dport.has_psram)
    {
        for (int i = 0; i < ESP32_CPU_COUNT; ++i)
        {
            Esp32CacheRegionState *dram1 = &s->dport.cache_state[i].dram1;
            memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], dram1->base, &dram1->illegal_access_trap_mem, -2);
            memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], dram1->base, &dram1->mem, -1);
        }
        init_cache_err = true;
    }
    if (init_cache_err) {
        qdev_connect_gpio_out_named( DEVICE(&s->dport), ESP32_DPORT_CACHE_ILL_IRQ_GPIO, 0,
                                    qdev_get_gpio_in(DEVICE(&s->intmatrix), ETS_CACHE_IA_INTR_SOURCE));
    }

    int n_crosscore_irqs = ESP32_DPORT_CROSSCORE_INT_COUNT;
    object_property_set_int( OBJECT(&s->crosscore_int), "n_irqs", n_crosscore_irqs, &error_abort);
    qdev_realize( DEVICE(&s->crosscore_int), &s->periph_bus, &error_fatal);
    memory_region_add_subregion_overlap( dport_mem, ESP32_DPORT_CROSSCORE_INT_BASE, &s->crosscore_int.iomem, -1);

    for (int index = 0; index < ESP32_DPORT_CROSSCORE_INT_COUNT; ++index)
    {
        qemu_irq target = qdev_get_gpio_in(DEVICE(&s->intmatrix), ETS_FROM_CPU_INTR0_SOURCE + index);
        assert(target);
        sysbus_connect_irq( SYS_BUS_DEVICE(&s->crosscore_int), index, target);
    }

    qdev_realize( DEVICE(&s->rsa), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->rsa, DR_REG_RSA_BASE);

    qdev_realize( DEVICE(&s->sha), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->sha, DR_REG_SHA_BASE);

    qdev_realize( DEVICE(&s->aes), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->aes, DR_REG_AES_BASE);

    qdev_realize( DEVICE(&s->ledc), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->ledc, DR_REG_LEDC_BASE);

    qdev_realize( DEVICE(&s->rtc_cntl), &s->rtc_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->rtc_cntl, DR_REG_RTCCNTL_BASE);

    qdev_connect_gpio_out_named( DEVICE(&s->rtc_cntl), ESP32_RTC_DIG_RESET_GPIO , 0, qdev_get_gpio_in_named( dev, ESP32_RTC_DIG_RESET_GPIO, 0));
    qdev_connect_gpio_out_named( DEVICE(&s->rtc_cntl), ESP32_RTC_CLK_UPDATE_GPIO, 0, qdev_get_gpio_in_named( dev, ESP32_RTC_CLK_UPDATE_GPIO, 0));

    for (int i = 0; i < ms->smp.cpus; ++i)
    {
        qdev_connect_gpio_out_named( DEVICE(&s->rtc_cntl), ESP32_RTC_CPU_RESET_GPIO, i, qdev_get_gpio_in_named( dev, ESP32_RTC_CPU_RESET_GPIO, i));
        qdev_connect_gpio_out_named( DEVICE(&s->rtc_cntl), ESP32_RTC_CPU_STALL_GPIO, i, qdev_get_gpio_in_named( dev, ESP32_RTC_CPU_STALL_GPIO, i));
    }

    qdev_realize( DEVICE(&s->gpio), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->gpio, DR_REG_GPIO_BASE);
    sysbus_connect_irq( SYS_BUS_DEVICE(&s->gpio),0,qdev_get_gpio_in(intmatrix_dev, ETS_GPIO_INTR_SOURCE));

    for (int i = 0; i < ESP32_UART_COUNT; ++i)
    {
        const hwaddr uart_base[] = {DR_REG_UART_BASE, DR_REG_UART1_BASE, DR_REG_UART2_BASE};
        qdev_realize( DEVICE(&s->uart[i]), &s->periph_bus, &error_fatal);
        esp32_soc_add_periph_device( sys_mem, &s->uart[i], uart_base[i]);
        sysbus_connect_irq( SYS_BUS_DEVICE( &s->uart[i]), 0, qdev_get_gpio_in(intmatrix_dev, ETS_UART0_INTR_SOURCE + i) );
    }

    for (int i = 0; i < ESP32_FRC_COUNT; ++i)
    {
        qdev_realize( DEVICE(&s->frc_timer[i]), &s->periph_bus, &error_fatal);
        esp32_soc_add_periph_device( sys_mem, &s->frc_timer[i], DR_REG_FRC_TIMER_BASE + i * ESP32_FRC_TIMER_STRIDE);
        sysbus_connect_irq( SYS_BUS_DEVICE(&s->frc_timer[i]), 0, qdev_get_gpio_in(intmatrix_dev, ETS_TIMER1_INTR_SOURCE + i));
    }

    for (int i = 0; i < ESP32_TIMG_COUNT; ++i)
    {
        s->timg[i].id = i;

        const hwaddr timg_base[] = {DR_REG_TIMERGROUP0_BASE, DR_REG_TIMERGROUP1_BASE};
        qdev_realize( DEVICE(&s->timg[i]), &s->periph_bus, &error_fatal);

        esp32_soc_add_periph_device( sys_mem, &s->timg[i], timg_base[i] );

        int timg_level_int[] = { ETS_TG0_T0_LEVEL_INTR_SOURCE, ETS_TG1_T0_LEVEL_INTR_SOURCE };
        int timg_edge_int[]  = { ETS_TG0_T0_EDGE_INTR_SOURCE , ETS_TG1_T0_EDGE_INTR_SOURCE };

