josuemoraisgh/qemu_lasecSimul/hw/xtensa/esp32-simul.c
        for (Esp32TimgInterruptType it = TIMG_T0_INT; it < TIMG_INT_MAX; ++it) {
            sysbus_connect_irq( SYS_BUS_DEVICE(&s->timg[i]), it, qdev_get_gpio_in(intmatrix_dev, timg_level_int[i] + it));
            sysbus_connect_irq( SYS_BUS_DEVICE(&s->timg[i]), TIMG_INT_MAX + it, qdev_get_gpio_in(intmatrix_dev, timg_edge_int[i] + it));
        }

        qdev_connect_gpio_out_named( DEVICE(&s->timg[i]), ESP32_TIMG_WDT_CPU_RESET_GPIO, 0, qdev_get_gpio_in_named(dev, ESP32_TIMG_WDT_CPU_RESET_GPIO, i));
        qdev_connect_gpio_out_named( DEVICE(&s->timg[i]), ESP32_TIMG_WDT_SYS_RESET_GPIO, 0, qdev_get_gpio_in_named(dev, ESP32_TIMG_WDT_SYS_RESET_GPIO, i));
    }
    s->timg[0].wdt_en_at_reset = true;
    const hwaddr spi_base[] = { DR_REG_SPI0_BASE, DR_REG_SPI1_BASE, DR_REG_SPI2_BASE, DR_REG_SPI3_BASE };

    // speed up vspi and hspi by allowng the controller to send 32 bits at a time.
    // this is only suppoerted by the st7789v
    //object_property_set_bool( OBJECT(&s->spi[2]),"xfer_32_bits",true, &error_abort);
    //object_property_set_bool( OBJECT(&s->spi[3]),"xfer_32_bits",true, &error_abort);
    //object_property_set_bool( OBJECT(&s->spi[2]),"use_cs", true, &error_abort);
    //object_property_set_bool( OBJECT(&s->spi[3]),"use_cs", true, &error_abort);

    for (int i = 0; i < ESP32_SPI_COUNT; ++i)
    {
        qdev_realize( DEVICE(&s->spi[i]), &s->periph_bus, &error_fatal);
        esp32_soc_add_periph_device( sys_mem, &s->spi[i], spi_base[i]);
        sysbus_connect_irq( SYS_BUS_DEVICE(&s->spi[i]), 0, qdev_get_gpio_in(intmatrix_dev, ETS_SPI0_INTR_SOURCE + i));
        s->spi[i].number = i;
    }

    qdev_realize( DEVICE(&s->rmt), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->rmt, DR_REG_RMT_BASE);
    sysbus_connect_irq( SYS_BUS_DEVICE(&s->rmt), 0, qdev_get_gpio_in(intmatrix_dev, ETS_RMT_INTR_SOURCE));

    const hwaddr i2c_base[] = { DR_REG_I2C_EXT_BASE, DR_REG_I2C1_EXT_BASE };
    for (int i = 0; i < ESP32_I2C_COUNT; i++)
    {
        qdev_realize( DEVICE(&s->i2c[i]), &s->periph_bus, &error_fatal);
        esp32_soc_add_periph_device( sys_mem, &s->i2c[i], i2c_base[i]);
        sysbus_connect_irq( SYS_BUS_DEVICE(&s->i2c[i]), 0, qdev_get_gpio_in(intmatrix_dev, ETS_I2C_EXT0_INTR_SOURCE + i));
    }

    qdev_realize( DEVICE(&s->rng), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->rng, ESP32_RNG_BASE);

    qdev_realize( DEVICE(&s->efuse), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->efuse, DR_REG_EFUSE_BASE);
    sysbus_connect_irq( SYS_BUS_DEVICE(&s->efuse), 0, qdev_get_gpio_in(intmatrix_dev, ETS_EFUSE_INTR_SOURCE));

    qdev_realize( DEVICE(&s->sens), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->sens, DR_REG_SENS_BASE);

    qdev_realize( DEVICE(&s->ana), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->ana, DR_REG_ANA_BASE);

    qdev_realize( DEVICE(&s->fe), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->fe, DR_REG_FE_BASE);

    qdev_realize( DEVICE(&s->phya), &s->periph_bus, &error_fatal);
    esp32_soc_add_periph_device( sys_mem, &s->phya, DR_REG_PHYA_BASE);

    qdev_realize( DEVICE(&s->flash_enc), &s->periph_bus, &error_abort);
    esp32_soc_add_periph_device( sys_mem, &s->flash_enc, DR_REG_SPI_ENCRYPT_BASE);

    qdev_connect_gpio_out_named( DEVICE(&s->efuse), ESP32_EFUSE_UPDATE_GPIO, 0, qdev_get_gpio_in_named( DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_EFUSE_UPDATE_GPIO, 0));
    qdev_connect_gpio_out_named( DEVICE(&s->dport), ESP32_DPORT_FLASH_ENC_EN_GPIO, 0, qdev_get_gpio_in_named( DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_ENC_EN_GPIO, 0));
    qdev_connect_gpio_out_named( DEVICE(&s->dport), ESP32_DPORT_FLASH_DEC_EN_GPIO, 0, qdev_get_gpio_in_named( DEVICE(&s->flash_enc), ESP32_FLASH_ENCRYPTION_DEC_EN_GPIO, 0));

    qdev_realize( DEVICE(&s->sdmmc), &s->periph_bus, &error_abort);
    esp32_soc_add_periph_device( sys_mem, &s->sdmmc, DR_REG_SDMMC_BASE);
    sysbus_connect_irq( SYS_BUS_DEVICE(&s->sdmmc), 0, qdev_get_gpio_in(intmatrix_dev, ETS_SDIO_HOST_INTR_SOURCE));

    qdev_realize( DEVICE(&s->iomux), &s->periph_bus, &error_abort);
    esp32_soc_add_periph_device( sys_mem, &s->iomux, DR_REG_IO_MUX_BASE);

    /* Provide internal RAM MemoryRegion to the RGB display */
    s->rgb.intram = dram;
    qdev_realize( DEVICE(&s->rgb), &s->periph_bus, &error_abort);
    esp32_soc_add_periph_device( sys_mem, &s->rgb, DR_REG_FRAMEBUF_BASE);
    memory_region_add_subregion_overlap(sys_mem, esp32_memmap[ESP32_MEMREGION_FRAMEBUF].base, &s->rgb.vram, 0);

    esp32_soc_add_unimp_device( sys_mem, "esp32.rtcio"        , DR_REG_RTCIO_BASE   , 0x400 , 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.hinf"         , DR_REG_HINF_BASE    , 0x1000, 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.slc"          , DR_REG_SLC_BASE     , 0x1000, 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.slchost"      , DR_REG_SLCHOST_BASE , 0x1000, 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.apbctrl"      , DR_REG_APB_CTRL_BASE, 0x1000, 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.i2s0"         , DR_REG_I2S_BASE     , 0x1000, 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.i2s1"         , DR_REG_I2S1_BASE    , 0x1000, 0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.fe2"          , DR_REG_FE2_BASE     , 0x1000,-1);
    esp32_soc_add_unimp_device( sys_mem, "esp32.chipv7_phy"   , DR_REG_PHY_BASE     , 0x1000,-1);
    esp32_soc_add_unimp_device( sys_mem, "esp32.chipv7_phyb"  , DR_REG_WDEV_BASE    , 0x1000,0);
    esp32_soc_add_unimp_device( sys_mem, "esp32.unknown_wifi" , DR_REG_NRX_BASE-0x0C00, 0x1000,-1);
    esp32_soc_add_unimp_device( sys_mem, "esp32.unknown_wifi1", DR_REG_BB_BASE      , 0x1000,-1);
    esp32_soc_add_unimp_device( sys_mem, "esp32.bluetooth"    , DR_REG_BT_BASE      , 0x1000,-1);

    const hwaddr apb_ctrl_date_reg = DR_REG_APB_CTRL_BASE + 0x7c;
    MemoryRegion *apbctrl_mem = g_new(MemoryRegion, 1);
    memory_region_init_ram( apbctrl_mem, NULL, "esp32.apbctrl_date_reg", 4 /* bytes */, &error_fatal);
    memory_region_add_subregion( sys_mem, apb_ctrl_date_reg, apbctrl_mem);
    uint32_t apb_ctrl_date_reg_val = 0x16042000 | 0x80000000;  /* MSB indicates ECO3 silicon revision */
    cpu_physical_memory_write( apb_ctrl_date_reg, &apb_ctrl_date_reg_val, 4 );

    qemu_register_reset( (QEMUResetHandler*) esp32_soc_reset, dev );
}

static void esp32_soc_init(Object *obj)
{
    Esp32SocState *s = ESP32_SOC(obj);
    MachineState *ms = MACHINE(qdev_get_machine());
    char name[16];

    MemoryRegion *system_memory = get_system_memory();

    qbus_init( &s->periph_bus, sizeof(s->periph_bus), TYPE_SYSTEM_BUS, DEVICE(s), "esp32-periph-bus");
    qbus_init( &s->rtc_bus   , sizeof(s->rtc_bus)   , TYPE_SYSTEM_BUS, DEVICE(s), "esp32-rtc-bus");

    for( int i=0; i<ms->smp.cpus; ++i) {
        snprintf( name, sizeof(name), "cpu%d", i );
        object_initialize_child( obj, name, &s->cpu[i], TYPE_ESP32_CPU );

        const uint32_t cpuid[ESP32_CPU_COUNT] = { 0xcdcd, 0xabab };
        s->cpu[i].env.sregs[PRID] = cpuid[i];

        snprintf( name, sizeof(name), "cpu%d-mem", i );
        memory_region_init( &s->cpu_specific_mem[i], NULL, name, UINT32_MAX );

