josuemoraisgh/qemu_lasecSimul/hw/xtensa/esp32-simul.c
        CPUState* cs = CPU(&s->cpu[i]);
        cs->num_ases = 1;
        cpu_address_space_init( cs, 0, "cpu-memory", &s->cpu_specific_mem[i] );

        MemoryRegion *cpu_view_sysmem = g_new(MemoryRegion, 1);
        snprintf(name, sizeof(name), "cpu%d-sysmem", i);
        memory_region_init_alias( cpu_view_sysmem, NULL, name, system_memory, 0, UINT32_MAX );
        memory_region_add_subregion_overlap( &s->cpu_specific_mem[i], 0, cpu_view_sysmem, 0 );
        cs->memory = &s->cpu_specific_mem[i];
    }

    for( int i=0; i<ESP32_UART_COUNT; ++i) {
        snprintf( name, sizeof(name), "uart%d", i );
        object_initialize_child( obj, name, &s->uart[i], TYPE_ESP32_UART );
    }

    object_initialize_child( obj, "gpio"         , &s->gpio         , TYPE_ESP32_GPIO );
    object_initialize_child( obj, "dport"        , &s->dport        , TYPE_ESP32_DPORT );
    object_initialize_child( obj, "intmatrix"    , &s->intmatrix    , TYPE_ESP32_INTMATRIX );
    object_initialize_child( obj, "crosscore_int", &s->crosscore_int, TYPE_ESP32_CROSSCORE_INT );
    object_initialize_child( obj, "rtc_cntl"     , &s->rtc_cntl     , TYPE_ESP32_RTC_CNTL );

    for( int i=0; i<ESP32_FRC_COUNT; ++i) {
        snprintf(name, sizeof(name), "frc%d", i);
        object_initialize_child(obj, name, &s->frc_timer[i], TYPE_ESP32_FRC_TIMER);
    }

    for( int i=0; i<ESP32_TIMG_COUNT; ++i) {
        snprintf(name, sizeof(name), "timg%d", i);
        object_initialize_child(obj, name, &s->timg[i], TYPE_ESP32_TIMG);
    }

    for( int i=0; i<ESP32_SPI_COUNT; ++i) {
        snprintf(name, sizeof(name), "spi%d", i);
        object_initialize_child(obj, name, &s->spi[i], TYPE_ESP32_SPI);
    }

    for( int i=0; i<ESP32_I2C_COUNT; ++i) {
        snprintf(name, sizeof(name), "i2c%d", i);
        object_initialize_child(obj, name, &s->i2c[i], TYPE_ESP32_I2C);
    }

    object_initialize_child( obj, "rng" , &s->rng , TYPE_ESP32_RNG);
    object_initialize_child( obj, "sha" , &s->sha , TYPE_ESP32_SHA);
    object_initialize_child( obj, "aes" , &s->aes , TYPE_ESP32_AES);
    object_initialize_child( obj, "ledc", &s->ledc, TYPE_ESP32_LEDC);
    object_initialize_child( obj, "rsa" , &s->rsa , TYPE_ESP32_RSA);
    object_initialize_child( obj, "sens", &s->sens, TYPE_ESP32_SENS);
    object_initialize_child( obj, "ana" , &s->ana , TYPE_ESP32_ANA);
    object_initialize_child( obj, "rmt" , &s->rmt , TYPE_ESP32_RMT);

    for(int i=0;i<nb_nics;i++){
        if (nd_table[i].used && nd_table[i].model && strcmp(nd_table[i].model, TYPE_ESP32_WIFI) == 0)
        {
            object_initialize_child( obj, "wifi", &s->wifi, TYPE_ESP32_WIFI);
            s->wifi_dev = DEVICE(&s->wifi);
        }
    }
    object_initialize_child( obj, "fe"       , &s->fe       , TYPE_ESP32_FE);
    object_initialize_child( obj, "phya"     , &s->phya     , TYPE_ESP32_PHYA);
    object_initialize_child( obj, "efuse"    , &s->efuse    , TYPE_ESP32_EFUSE);
    object_initialize_child( obj, "flash_enc", &s->flash_enc, TYPE_ESP32_FLASH_ENCRYPTION);
    object_initialize_child( obj, "sdmmc"    , &s->sdmmc    , TYPE_DWC_SDMMC);
    object_initialize_child( obj, "iomux"    , &s->iomux    , TYPE_ESP32_IOMUX);
    object_initialize_child( obj, "rgb"      , &s->rgb      , TYPE_ESP_RGB);

    qdev_init_gpio_in_named( DEVICE(s), esp32_dig_reset     , ESP32_RTC_DIG_RESET_GPIO, 1);
    qdev_init_gpio_in_named( DEVICE(s), esp32_cpu_reset     , ESP32_RTC_CPU_RESET_GPIO, ESP32_CPU_COUNT);
    qdev_init_gpio_in_named( DEVICE(s), esp32_cpu_stall     , ESP32_RTC_CPU_STALL_GPIO, ESP32_CPU_COUNT);
    qdev_init_gpio_in_named( DEVICE(s), esp32_clk_update    , ESP32_RTC_CLK_UPDATE_GPIO, 1);
    qdev_init_gpio_in_named( DEVICE(s), esp32_timg_cpu_reset, ESP32_TIMG_WDT_CPU_RESET_GPIO, 2);
    qdev_init_gpio_in_named( DEVICE(s), esp32_timg_sys_reset, ESP32_TIMG_WDT_SYS_RESET_GPIO, 2);
}

static Property esp32_soc_properties[] = {
    DEFINE_PROP_END_OF_LIST(),
};

static void esp32_soc_class_init( ObjectClass *klass, void *data )
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = esp32_soc_realize;
    device_class_set_props(dc, esp32_soc_properties);
}

static const TypeInfo esp32_soc_info = {
    .name = TYPE_ESP32_SOC,
    .parent = TYPE_DEVICE,
    .instance_size = sizeof(Esp32SocState),
    .instance_init = esp32_soc_init,
    .class_init = esp32_soc_class_init
};

static void esp32_soc_register_types(void)
{
    type_register_static( &esp32_soc_info );
}

type_init(esp32_soc_register_types)


static uint64_t translate_phys_addr( void *opaque, uint64_t addr )
{
    XtensaCPU *cpu = opaque;

    return cpu_get_phys_page_debug(CPU(cpu), addr);
}

struct Esp32MachineState {
    MachineState parent;

    Esp32SocState esp32;
    DeviceState *flash_dev;
};
#define TYPE_ESP32_MACHINE MACHINE_TYPE_NAME("esp32-simul")

OBJECT_DECLARE_SIMPLE_TYPE(Esp32MachineState, ESP32_MACHINE)


static void esp32_machine_init_spi_flash( Esp32SocState *ss, BlockBackend* blk )
{
    /* "main" flash chip is attached to SPI1, CS0 */
    DeviceState *spi_master = DEVICE( &ss->spi[1] );
    BusState* spi_bus = qdev_get_child_bus( spi_master, "spi");

    /* select the flash chip based on the image size */
    int64_t image_size = blk_getlength( blk );
    const char* flash_chip_model = NULL;
    switch (image_size) {
        case  2 * 1024 * 1024: flash_chip_model = "w25x16"; break;
        case  4 * 1024 * 1024: flash_chip_model = "gd25q32"; break;
        case  8 * 1024 * 1024: flash_chip_model = "gd25q64"; break;
        case 16 * 1024 * 1024: flash_chip_model = "is25lp128"; break;
        default: error_report("Error: only 2, 4, 8, 16 MB flash images are supported"); return;
    }
printf("Qemu: initializing SPI Flash '%s' %li MB\n", flash_chip_model, image_size/(1024*1024) );
    DeviceState *flash_dev = qdev_new(flash_chip_model);
    qdev_prop_set_drive(flash_dev, "drive", blk);
    qdev_realize_and_unref(flash_dev, spi_bus, &error_fatal);
    qdev_connect_gpio_out_named(spi_master, SSI_GPIO_CS, 0,
                                qdev_get_gpio_in_named(flash_dev, SSI_GPIO_CS, 0));
}

static void esp32_machine_init_psram( Esp32SocState *ss, uint32_t size_mbytes )
{
    /* PSRAM attached to SPI1, CS1 */
    DeviceState *spi_master = DEVICE( &ss->spi[1] );
    BusState* spi_bus = qdev_get_child_bus( spi_master, "spi");
    DeviceState *psram = qdev_new(TYPE_SSI_PSRAM);
    qdev_prop_set_uint32( psram, "size_mbytes", size_mbytes );
    qdev_prop_set_uint8( psram, "cs", 1 );
    qdev_realize_and_unref( psram, spi_bus, &error_fatal );

