josuemoraisgh/qemu_lasecSimul/hw/xtensa/esp32-simul.c
    qemu_irq ssi_cs_irq = qdev_get_gpio_in_named( psram, SSI_GPIO_CS, 0 );
    qdev_connect_gpio_out_named( spi_master, SSI_GPIO_CS, 1, ssi_cs_irq );
}

static void esp32_machine_init_openeth(Esp32SocState *ss)
{
    SysBusDevice *sbd;
    MemoryRegion* sys_mem = get_system_memory();
    hwaddr reg_base = DR_REG_EMAC_BASE;
    hwaddr desc_base = reg_base + 0x400;

    for( int i=0; i<nb_nics; i++ )
    {
        const char* type_openeth = "open_eth";
        NICInfo *nd = &nd_table[i];

        if( nd->used && nd->model && strcmp(nd->model, type_openeth) == 0 )
        {
            DeviceState* open_eth_dev = qdev_new(type_openeth);
            ss->eth = open_eth_dev;
            qdev_set_nic_properties(open_eth_dev, nd);
            sbd = SYS_BUS_DEVICE(open_eth_dev);
            sysbus_realize_and_unref(sbd, &error_fatal);
            sysbus_connect_irq(sbd, 0, qdev_get_gpio_in(DEVICE(&ss->intmatrix), ETS_ETH_MAC_INTR_SOURCE));
            memory_region_add_subregion(sys_mem, reg_base, sysbus_mmio_get_region(sbd, 0));
            memory_region_add_subregion(sys_mem, desc_base, sysbus_mmio_get_region(sbd, 1));
        }

        if( nd->used && nd->model && strcmp(nd->model, TYPE_ESP32_WIFI) == 0 )
        {
            //get macaddres from efuse file
            device_cold_reset( DEVICE(&ss->efuse) );
            char * mptr = (char *)&ss->efuse.efuse_rd.blk0[1];
            for( int j=0; j<6 ; j++ ){
                ss->wifi.macaddr[j]=mptr[5-j];
            }
            qdev_set_nic_properties(DEVICE(&ss->wifi), nd);
            sbd = SYS_BUS_DEVICE(DEVICE(&ss->wifi));
            sysbus_realize_and_unref(sbd, &error_fatal);
            esp32_soc_add_periph_device( sys_mem, &ss->wifi, DR_REG_WIFI_BASE);
            sysbus_connect_irq( SYS_BUS_DEVICE(&ss->wifi), 0,
                               qdev_get_gpio_in(DEVICE(&ss->intmatrix), ETS_WIFI_MAC_INTR_SOURCE));
        }
    }
}

static void esp32_machine_init_sd( Esp32SocState *ss )
{
    DriveInfo *dinfo = drive_get( IF_SD, 0, 0 );
    if( dinfo ) {
        DeviceState *card;

        card = qdev_new( TYPE_SD_CARD );
        qdev_prop_set_drive_err( card, "drive", blk_by_legacy_dinfo(dinfo), &error_fatal );

        /* See the comment on not using sysbus-default in esp32_machine_init_i2c */
        DeviceState *sdmmc = DEVICE( &ss->sdmmc );
        SDBus* sd_bus = SD_BUS( qdev_get_child_bus( sdmmc, "sd-bus") );
        qdev_realize_and_unref( card, BUS(sd_bus), &error_fatal );
    }
}

static void esp32_machine_init(MachineState *machine)
{
    BlockBackend* blk = NULL;
    DriveInfo *dinfo = drive_get( IF_MTD, 0, 0 );
    if( dinfo) {
        qemu_log("Adding SPI flash device\n");
        blk = blk_by_legacy_dinfo( dinfo );
    } else {
        qemu_log("Not initializing SPI Flash\n");
    }

    Esp32MachineState *ms = ESP32_MACHINE(machine);
    object_initialize_child( OBJECT(ms), "soc", &ms->esp32, TYPE_ESP32_SOC );
    Esp32SocState *ss = ESP32_SOC( &ms->esp32 );

    if( blk ) ss->dport.flash_blk = blk;

    if( machine->ram_size > 0 )
        qdev_prop_set_bit( DEVICE(&ss->dport), "has_psram", true );

    qdev_realize( DEVICE(ss), NULL, &error_fatal );

    if( blk ) esp32_machine_init_spi_flash( ss, blk );

    if( machine->ram_size > 0 )
        esp32_machine_init_psram( ss, (uint32_t) (machine->ram_size / MiB) );

    /// esp32_machine_init_i2c( ss );
    esp32_machine_init_openeth( ss );
    esp32_machine_init_sd( ss );

    /* Need MMU initialized prior to ELF loading, so that ELF gets loaded into virtual addresses */
    cpu_reset( CPU(&ss->cpu[0]) );

    const char *load_elf_filename = NULL;
    if( machine->firmware ) load_elf_filename = machine->firmware;

    if( machine->kernel_filename ) {
        qemu_log("Warning: both -bios and -kernel arguments specified. Only loading the the -kernel file.\n");
        load_elf_filename = machine->kernel_filename;
    }

    if( load_elf_filename )
    {
        uint64_t elf_entry;
        uint64_t elf_lowaddr;
        int size = load_elf( load_elf_filename, NULL,
                               translate_phys_addr, &ss->cpu[0],
                               &elf_entry, &elf_lowaddr,
                               NULL, NULL, 0, EM_XTENSA, 0, 0 );
        if( size < 0 ) {
            error_report("Error: could not load ELF file '%s'", load_elf_filename);
            exit(1);
        }
        printf("Qemu: loading ELF file '%s'\n", load_elf_filename );

        if( elf_entry != XCHAL_RESET_VECTOR_PADDR ) {
            // Since ROM is empty when loading elf file AND
            // PC value is 0x40000400 after reset
            // need to jump to elf entry point to run a programm
            uint8_t p[4];
            memcpy(p, &elf_entry, 4);
            uint8_t boot[] = {
                0x06, 0x01, 0x00,       /* j    1 */
                0x00,                   /* .literal_position */
                p[0], p[1], p[2], p[3], /* .literal elf_entry */
                                        /* 1: */
                0x01, 0xff, 0xff,       /* l32r a0, elf_entry */
                0xa0, 0x00, 0x00,       /* jx   a0 */
            };
            // Write boot function to reset-vector address (0x40000400) of the CPU 0
            rom_add_blob_fixed_as("boot", boot, sizeof(boot), XCHAL_RESET_VECTOR_PADDR, CPU(&ss->cpu[0])->as);
            ss->cpu[0].env.pc = XCHAL_RESET_VECTOR_PADDR;
        }
    } else {
        char *rom_binary = qemu_find_file(QEMU_FILE_TYPE_BIOS, "esp32-v3-rom.bin");
        if( rom_binary == NULL) {
            error_report("Error: -bios argument not set, and ROM code binary not found (1)");
            exit(1);
        }
        printf("Qemu: loading ROM binary '%s'\n", rom_binary );

        int size = load_image_targphys_as(rom_binary, esp32_memmap[ESP32_MEMREGION_IROM].base, esp32_memmap[ESP32_MEMREGION_IROM].size, CPU(&ss->cpu[0])->as);
        if( size < 0) {
            error_report("Error: could not load ROM binary '%s'\n", rom_binary);
            exit(1);
        }
        g_free(rom_binary);

        rom_binary = qemu_find_file(QEMU_FILE_TYPE_BIOS, "esp32-v3-rom-app.bin");
        if( rom_binary == NULL) {
            error_report("Error: -bios argument not set, and ROM code binary not found (2)");
            exit(1);
        }
        printf("Qemu: loading APP binary '%s'\n", rom_binary );

        size = load_image_targphys_as(rom_binary, esp32_memmap[ESP32_MEMREGION_IROM].base, esp32_memmap[ESP32_MEMREGION_IROM].size, CPU(&ss->cpu[1])->as);
        if( size < 0 ) {
            error_report("Error: could not load ROM binary '%s'", rom_binary);
            exit(1);
        }
        g_free( rom_binary );
    }
}

static ram_addr_t esp32_fixup_ram_size(ram_addr_t requested_size)
{
    ram_addr_t size;
    if     ( requested_size == 0       ) size = 0;
    else if( requested_size <= 2 * MiB ) size = 2 * MiB;
    else if( requested_size <= 4 * MiB ) size = 4 * MiB;
    else {                               size = 4 * MiB;
        qemu_log("RAM size larger than 4 MB not supported\n");
    }
    return size;
}

/* Initialize machine type */
static void esp32_machine_class_init(ObjectClass *oc, void *data)
{
    MachineClass *mc = MACHINE_CLASS(oc);
    mc->desc = "Espressif ESP32 machine";
    mc->init = esp32_machine_init;
    mc->max_cpus = 2;
    mc->default_cpus = 2;
    mc->default_ram_size = 0;
    mc->fixup_ram_size = esp32_fixup_ram_size;
}

static const TypeInfo esp32_info = {
    .name = TYPE_ESP32_MACHINE,
    .parent = TYPE_MACHINE,
    .instance_size = sizeof(Esp32MachineState),
    .class_init = esp32_machine_class_init,
};

static void esp32_machine_type_init(void)
{
    type_register_static(&esp32_info);
}

type_init(esp32_machine_type_init);
